In [28]:
import numpy as np
import pandas as pd

data = {
    '날짜': ['3/20', '3/21', '3/22', '3/23', '3/24'],
    '매출 편차': np.random.randn(5),
    '손님 평균 연령': np.random.randint(10, 60, 5)
}

df = pd.DataFrame(data)
df

     날짜     매출 편차  손님 평균 연령
0  3/20 -0.936982        51
1  3/21 -0.757327        15
2  3/22 -0.703708        43
3  3/23  0.451675        24
4  3/24  1.381569        24

In [29]:
df['매출 편차']

0   -0.936982
1   -0.757327
2   -0.703708
3    0.451675
4    1.381569
Name: 매출 편차, dtype: float64

In [30]:
df[df['손님 평균 연령'] >= 20]

     날짜     매출 편차  손님 평균 연령
0  3/20 -0.936982        51
2  3/22 -0.703708        43
3  3/23  0.451675        24
4  3/24  1.381569        24

In [31]:
df.loc[2, '매출 편차'] = np.nan
df.iloc[4, 2] = np.nan

df

     날짜     매출 편차  손님 평균 연령
0  3/20 -0.936982      51.0
1  3/21 -0.757327      15.0
2  3/22       NaN      43.0
3  3/23  0.451675      24.0
4  3/24  1.381569       NaN

In [32]:
df.isnull()

      날짜  매출 편차  손님 평균 연령
0  False  False     False
1  False  False     False
2  False   True     False
3  False  False     False
4  False  False      True

In [33]:
df['매출 편차'].fillna(0)

0   -0.936982
1   -0.757327
2    0.000000
3    0.451675
4    1.381569
Name: 매출 편차, dtype: float64

In [34]:
df['손님 평균 연령'].fillna(df['손님 평균 연령'].mean())

0    51.00
1    15.00
2    43.00
3    24.00
4    33.25
Name: 손님 평균 연령, dtype: float64

In [35]:
import pandas as pd

url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv"
df = pd.read_csv(url)

df_7 = df.head(7)
df_7

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2

In [36]:
df_7[df_7["total_bill"] <= 20]

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
6        8.77  2.00    Male     No  Sun  Dinner     2

In [37]:
df_7.sort_values(by="tip", ascending=False)

   total_bill   tip     sex smoker  day    time  size
5       25.29  4.71    Male     No  Sun  Dinner     4
4       24.59  3.61  Female     No  Sun  Dinner     4
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
6        8.77  2.00    Male     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
0       16.99  1.01  Female     No  Sun  Dinner     2